tutorials/case328-poiseuille-graetz/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | multiSpeciesRegionFoam
   \\    /   O peration     | Case:     case328-poiseuille-graetz
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Validation of speciesFluid against two classical analytical results:
//
//   1. Poiseuille velocity profile  (hydrodynamic fully-developed flow)
//   2. Graetz Nusselt number        (thermally fully-developed, Nu_∞ = 7.54)
//
// Single fluid region — water at 20°C, Re = 20, both walls at T_wall = 373 K.
// Hydrodynamic entry length ≈ 1.6 mm, thermal entry length ≈ 11 mm.
// From y ≈ 25 mm onward both profiles are fully developed.

application     foamMultiRun;

regionSolvers
{
    fluid       speciesFluid;
}

libs
(
    "libspeciesTransport.so"
    "libspeciesCoupling.so"
    "libspeciesSolid.so"
    "libspeciesFluid.so"
);

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         30;

deltaT          0.005;

writeControl    runTime;
writeInterval   10;

purgeWrite      2;

writeFormat     ascii;
writePrecision  8;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable yes;

// ************************************************************************* //
