tutorials/case328-poiseuille-graetz/system/fluid/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | multiSpeciesRegionFoam
   \\    /   O peration     | Case:     case328-poiseuille-graetz / fluid
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Re = 20, Courant ≈ 0.5 with Δt = 0.005 s.
// linearUpwind for U and T: second-order bounded, low numerical diffusion.
// upwind for C_test: mandatory for astronomical species Peclet numbers.

ddtSchemes
{
    default     Euler;
}

gradSchemes
{
    default     Gauss linear;
}

divSchemes
{
    default             none;
    div(phi,U)          Gauss linearUpwind grad(U);
    div(phi,T)          Gauss linearUpwind grad(T);
    div(phi,C_test)     Gauss upwind;
}

laplacianSchemes
{
    default     Gauss linear corrected;
}

interpolationSchemes
{
    default     linear;
}

snGradSchemes
{
    default     corrected;
}

// ************************************************************************* //
